// Keyboard HID (handsfree) panel
"MSG_TYPE_PASSKEY" = "Escribe el código siguiente y pulsa la tecla Retorno.";

"MSG_PAIRING_TIMEOUT" = "No se ha podido establecer el enlace con “%@”. Haz clic en Enlazar para intentarlo de nuevo.";
"MSG_PAIRING_TIMEOUT_AUTO" = "No se ha podido establecer el enlace con “%@”. Se intentará con el teclado siguiente en 5 segundos.";
"MSG_PAIRING_TIMEOUT_AUTO_LAST" = "No se ha podido establecer el enlace con “%@”. Se intentará de nuevo en 5 segundos.";

"MSG_PAIRING_FAILED" = "No se ha podido establecer el enlace con el teclado. Haz clic en Enlazar para intentarlo de nuevo.";
"MSG_PAIRING_FAILED_AUTO" = "No se ha podido establecer el enlace con el teclado. Se está intentando de nuevo…";

// Discovery Panel (General)
"kDiscovery_Gen_ErrorOccurredSearchingKey" = "Se ha producido un error al buscar dispositivos inalámbricos.";


//getPairingWithDeviceTitle;
"TITLE_PAIRING_WITH_YOUR_KEYBOARD" = "Enlazando con el teclado “%@”.";
"TITLE_PAIRING_WITH_YOUR_MOUSE" = "Enlazando con el ratón “%@”.";

//getSearchingForDeviceTitle;
"TITLE_SEARCHING_FOR_YOUR_KEYBOARD" = "Buscando el teclado…";
"TITLE_SEARCHING_FOR_YOUR_MOUSE" = "Buscando el ratón…";

//getDevicePairedTitle
"TITLE_PAIRED_KEYBOARD" = "El ordenador se ha enlazado correctamente con “%@”.";
"TITLE_PAIRED_MOUSE" = "El ordenador se ha enlazado correctamente con “%@”";

//getNFoundTitle
"TITLE_KEYBOARD_N_FOUND" = "El Asistente de Configuración ha encontrado %d teclados inalámbricos.";
"TITLE_MOUSE_N_FOUND" = "El Asistente de Configuración ha encontrado %d ratones inalámbricos.";

//getFoundTitle
"TITLE_KEYBOARD_FOUND" = "El Asistente de Configuración ha detectado el teclado llamado “%@”.";
"TITLE_MOUSE_FOUND" = "El Asistente de Configuración ha detectado el ratón llamado “%@”.";

//getMessageStartPairing
"MSG_START_PAIRING_KEYBOARD" = "Selecciona tu teclado en la lista y haz clic en Enlazar. Cuando el teclado esté enlazado, se mostrará un código que deberás escribir con el teclado.";
"MSG_START_PAIRING_MOUSE" = "El Asistente de Configuración está intentando establecer enlaces con cada uno de los ratones de la lista. Cuando el ratón esté enlazado, podrás mover el puntero mediante el ratón.";

//getMessageStartPairingSingle
"MSG_START_PAIRING_KEYBOARD_SINGLE" = "El enlace con “%@” se iniciará automáticamente. Cuando el teclado esté enlazado, se mostrará un código que deberás escribir en el teclado.";
"MSG_START_PAIRING_MOUSE_SINGLE" = "El enlace con “%@” se iniciará automáticamente. Cuando el ratón esté enlazado, podrás mover el puntero mediante el ratón.";

//getMessageDeviceNotFound
"MSG_KEYBOARDS_NOT_FOUND_SO_FAR" = "No se ha encontrado ningún teclado. Buscando…";
"MSG_MOUSE_NOT_FOUND_SO_FAR" = "No se ha encontrado ningún ratón. Buscando…";

//getMessageNoDevice
"MSG_NO_KEYBOARD" = "No hay ningún ratón conectado al ordenador. Conecta uno.";
"MSG_NO_MOUSE" = "No hay ningún ratón conectado al ordenador. Conecta uno.";

//getMessageNoDeviceBT
"MSG_NO_KEYBOARD_BLUETOOTH"	= "No hay ningún teclado conectado al ordenador. Conecta uno.\n\nSi utilizas un teclado Apple Wireless Keyboard, asegúrate de que las pilas están colocadas correctamente y de que está encendido.";
"MSG_NO_MOUSE_BLUETOOTH" = "No hay ningún ratón conectado al ordenador. Conecta uno.\n\nSi utilizas un ratón Apple Wireless Mouse, enciéndelo deslizando la tapa de la parte inferior del ratón de modo que el LED esté visible.\n\nSi no utilizas ratón, conecta el teclado.";

//getMessageGettingDeviceName
"MSG_GETTING_KEYBOARD_NAMES" = "Actualizando %d nombres de teclado...";
"MSG_GETTING_MOUSE_NAMES" = "Actualizando %d nombres de ratón...";

//getMessageWaitingForAcknowlegement
"MSG_WAITING_FOR_KEYBOARD_ACKNOWLEGEMENT" = "Para reconocer el enlace, pulsa la tecla Retorno. Si no lo haces, se establecerá el enlace de nuevo en %d segundos.";
"MSG_WAITING_FOR_MOUSE_ACKNOWLEGEMENT" = "Para reconocer el enlace, haz clic con el ratón en el botón Aceptar siguiente. Si no lo haces, se establecerá el enlace de nuevo en %d segundos.";

//getMessageAuthenticationFailure
"MSG_AUTH_FAILURE_KEYBOARD" = "El código introducido es incorrecto. Haz clic en Enlazar para intentarlo de nuevo.";
"MSG_AUTH_FAILURE_MOUSE" = "No se ha podido establecer el enlace con el ratón. Haz clic en Enlazar para intentarlo de nuevo.";

//getMessageAuthenticationFailureAuto
"MSG_AUTH_FAILURE_KEYBOARD_AUTO" = "El código introducido es incorrecto. Se volverá a intentar establecer el enlace con el teclado en 5 segundos.";
"MSG_AUTH_FAILURE_MOUSE_AUTO" = "No se ha podido establecer el enlace con el ratón. Se volverá a intentar establecer el enlace con el ratón en 5 segundos.";

//getMessageAlreadyPaired
"MSG_ALREADY_PAIRED_KEYBOARD" = "Esperando a que el teclado se conecte…";
"MSG_ALREADY_PAIRED_MOUSE" = "Haga clic con el ratón para empezar a usarlo.";

// ** WARNINGS **
//getWarningPairingSingle
"MSG_WARNING_PAIRING_MOUSE_SINGLE" = "Si éste no es tu ratón, comprueba que esté encendido y espera a que la búsqueda se inicie de nuevo.";
"MSG_WARNING_PAIRING_KEYBOARD_SINGLE" = "Si este no es tu teclado, comprueba que esté encendido y espera a que la búsqueda se inicie de nuevo.";

//getWarningPairing 
"MSG_WARNING_PAIRING_MOUSE" = "Si tu ratón no está en la lista, comprueba que esté encendido y espera a que la búsqueda se inicie de nuevo.";
"MSG_WARNING_PAIRING_KEYBOARD" = "Si tu teclado no está en la lista, comprueba que esté encendido. Haz clic en Cancelar para buscarlo de nuevo.";

//getWarningAcknowlegement
"MSG_WARNING_ACK_MOUSE" = "Si el puntero no se mueve cuando mueves el ratón, tu ratón no está enlazado con el ordenador. Espera hasta que el proceso de enlace se inicie de nuevo.";
"MSG_WARNING_ACK_KEYBOARD" = "Si pulsas la tecla Retorno y no se reconoce el enlace, tu teclado no está enlazado con el ordenador. Espera hasta que el proceso de enlace se inicie de nuevo.";

// ** PAIRING STATUS **
//getMessagePairingStarting
"MSG_PAIRING_STARTING" = "Enlazando con el dispositivo...";

//getMessagePairingConnectingToDevice
"MSG_PAIRING_CONNECTING" = "Conectando…";

//getMessagePairingConnectionEstablished
"MSG_PAIRING_CONNECTION_ESTABLISHED" = "Conectado.";

//getMessagePairingConnectionComplete
"MSG_PAIRING_COMPLETE" = "Enlace establecido.";

"CUSTOM_MOUSE_NAME"	= "Ratón de %@";
"CUSTOM_KEYBOARD_NAME"	= "Teclado de %@";

